<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<style>
 @page {size: A4;margin: 1cm 1.5cm 1.5cm 1.5cm;}
 body{font-family: 'Microsoft YaHei';padding:0;margin:0;font-size: 10.2pt;font-weight: normal;line-height: 13pt;}
 .style9{font-size: 14.2pt;font-weight: bold;line-height: 19pt;text-align:center;color: #333333;}
 .style10{line-height:15pt;color: #333333;}
 .style12{line-height:15pt;font-family: 'Microsoft YaHei';font-size: 10.2pt;font-weight: normal;color: #333333;}
 p.MsoNormal{margin:0cm;margin-bottom:.0001pt;text-align:justify;text-justify:inter-ideograph;text-indent:2em;color: #333333;}
</style>
</head>
<body>
	 <div  style="width:94%;layout-grid:15.6pt;margin: 0 auto;">
		<p class="style9">中国电信股份有限公司${areaName}分公司</p>
		<p class="style9">业务服务协议</p>
		<p class="style10">甲方：${custName}</p>
		<p class="style10">乙方：中国电信股份有限公司${areaName}分公司</p>

		<p class="MsoNormal">为维护双方利益，根据国家相关法律、法规的规定，甲乙双方在平等、自愿、公平、诚实、信用的基础上，就电信业务服务的有关事宜，达成协议如下：</p>

		<p class="MsoNormal">第一条 网络服务</p>

		<p class="MsoNormal">1.1
			乙方应以本协议约定的方式公示网络覆盖范围及漫游范围，在覆盖范围内，向甲方提供网络服务、客户服务及甲方申请开通的各项通信服务。甲方申请开通默认服务以外的其他通信服务，应按乙方规定办理手续，并缴纳费用。国际漫游服务只能在与乙方签订漫游协议的电信运营商网络覆盖范围内享有。</p>

		<p class="MsoNormal">1.2 乙方提供的网络服务应符合国家规定的通信服务质量标准。</p>

		<p class="MsoNormal">1.3 乙方依法保障甲方的通信自由和通信秘密。</p>

		<p class="MsoNormal">第二条 入网要求</p>

		<p class="MsoNormal">2.1 甲方办理入网、变更等手续时，应提交以下登记资料：</p>

		<p class="MsoNormal">2.1.1
			个人客户：提供真实有效的本人有效身份证件原件（委托他人办理的应同时提交委托人及本人有效身份证件原件），有效证件包括居民身份证、户口簿、军/警官证、护照（仅适用于外国公民或港澳台同胞）等；</p>

		<p class="MsoNormal">2.1.2
			单位客户：提供真实有效的本单位注册登记证照资料，并提供经办人有效身份证件原件。</p>

		<p class="MsoNormal">2.2
			甲方应使用已获得国家入网许可的通信终端设备；当申请开通默认服务以外的服务项目时，通信终端设备还应具备相应功能，否则可能无法支持所选服务，甲方将自行承担损失。</p>

		<p class="MsoNormal">2.3 乙方要求甲方提供担保的，甲方应办理相应担保手续。</p>

		<p class="MsoNormal">第三条 客户资料</p>

		<p class="MsoNormal">
			3.1
			甲方应保证入网登记资料真实有效、准确、完整，并有义务配合乙方通过电话等方式对登记资料进行核实。本协议有效期内，甲方登记资料如有变更，应主动办理变更手续。<b>如乙方发现甲方登记资料失实，影响本协议正常履行，且无法与甲方取得联系或甲方不及时配合更正的，乙方有权暂停甲方网络服务（“停机”）。</b>
		</p>

		<p class="MsoNormal">
			<b>3.2
				客户服务密码是甲方办理业务的重要凭证，除非另有约定或说明，凡使用服务密码定制、变更业务的行为均被视为甲方或甲方授权的行为，甲方入网后应立即修改初始服务密码，并妥善保管服务密码，如甲方原因泄露服务密码或为他人获取的，由甲方自行承担损失和责任。</b>但乙方有义务协助甲方或公安机关调查相关情况。
		</p>

		<p class="MsoNormal">3.3
			甲方向乙方提供的客户资料，乙方承诺用于通信服务的全过程，乙方对甲方提供的客户资料依法负有保密义务，不得泄露。但法律、法规或政府规章另有规定的除外。</p>

		<p class="MsoNormal">第四条 费用标准和费用缴纳</p>

		<p class="MsoNormal">4.1
			乙方应在国家允许的范围内设定资费标准，以本协议约定的方式向甲方明示资费标准、计费方式、缴费期限等信息；甲方应按乙方明示的期限足额缴纳各项通信费用。</p>

		<p class="MsoNormal">4.2
			如遇国家统一调整通信费用标准的，按国家统一规定的时间起执行；如遇乙方发布、调整资费的，在乙方公告确定的生效日起执行。</p>

		<p class="MsoNormal">4.3 计费周期为自然月，即每月 1 日 0 时至当月最后一日 24
			时。（由于网络设备产生话单及相关处理会有时延，可能会发生当月部分话费计入下月话费中收取的情况）</p>

		<p class="MsoNormal">4.4
			根据选择的业务种类，甲方按预付费或后付费方式支付费用。除特殊约定外，后付费方式下甲方按月支付费用，每月 2 日至次月 1
			日为支付上月费用的缴费期限。预付费方式下甲方需预存金额，当账户余额不足以支付甲方拟使用的业务费用时，甲方需及时充值。</p>

		<p class="MsoNormal">
			<b>4.5
				甲方未按期足额缴纳通信费用的，乙方有权暂停欠费产品及相关套餐或账户内的其他产品的服务；甲方超过缴费时限，每日须按欠费金额３‰的标准支付违约金（因乙方原因造成甲方不能交费的情况除外）；甲方交清欠费和违约金后，乙方应在
				24 小时内恢复甲方通信服务。</b>
		</p>

		<p class="MsoNormal">4.6 甲方在欠费情况下，不能办理除交费外的其他业务。</p>

		<p class="MsoNormal">4.7
			甲方定制第三方增值业务或其它收费业务，乙方可以代第三方向甲方收取信息费、包月费等，甲方使用第三方提供的增值业务或其它收费业务，收费标准由该第三方制定、公布。</p>

		<p class="MsoNormal">4.8
			因甲方手机终端中的软件自动升级、运行等原因产生的网络流量，甲方应承担相应流量所产生的费用。</p>

		<p class="MsoNormal">
			<b>4.9
				甲方如选择或终止银行托收、银行代扣等方式支付通信费用时，甲方需到银行等托收机构办理相应手续。在确保结清通信费用及违约金（如有）的情况下，甲方终止本协议服务的，应到银行等托收机构办理相应的终止手续。</b>
		</p>

		<p class="MsoNormal">第五条 风险控制</p>

		<p class="MsoNormal">
			<b>5.1 甲方应妥善保管自己的通信终端及密码不被非法盗用，若发现通信费用异常增长，经初步核查确有问题的，可及时拨打客服热线
				10000 或到乙方营业网点办理暂时停机手续，并向公安机关报案，乙方应积极配合公安部门调查相关情况。</b>
		</p>

		<p class="MsoNormal">
			<b>5.2
				甲方未付的通信费用达到乙方明示或另行通知的话费信用额度时，应及时缴纳通信费用；否则，乙方有权停机。（超过信用额度停机不受约定缴费期限的限制）</b>
		</p>

		<p class="MsoNormal">
			<b>5.3 在下列情况下，乙方有权暂停或限制甲方的通信服务，由此给甲方造成的损失，乙方不承担责任。</b>
		</p>

		<p class="MsoNormal">
			<b>（1）甲方银行帐户被查封、冻结或余额不足等非乙方原因造成乙方结算时划扣不成功的；</b>
		</p>

		<p class="MsoNormal">
			<b>（2）甲方预付费使用完毕而未及时补交款项（包括预付费帐户余额不足以划扣下一笔预付费用）的；后付费未在规定时间内缴清欠费的；</b>
		</p>

		<p class="MsoNormal">
			<b>（4）甲方利用乙方提供的服务从事违法犯罪活动或损害社会公共利益的活动的。</b>
		</p>

		<p class="MsoNormal">
			<b>5.4
				若甲方出现异常巨额通信费，乙方一经发现，应尽可能及时告知甲方，在告知后仍未得到甲方确认的，乙方可暂停部分或全部的通信服务，直至甲方缴清已发生费用。</b>
		</p>


		<p class="MsoNormal">
			<b>5.5 甲方在欠费情况下，乙方有权拒绝为甲方开办其他业务（含移动、固网、宽带等所有业务），直至其补交全部欠费及违约金。</b>
		</p>

		<p class="MsoNormal">
			<b>5.6 一方违约给对方造成损失的，应当依法承担违约责任。</b>
		</p>

		<p class="MsoNormal">第六条 客户服务</p>

		<p class="MsoNormal">6.1
			乙方在营业场所、门户网站公布电信业务的服务项目、服务时限、服务公约、资费标准等内容。</p>

		<p class="MsoNormal">
			6.2 乙方向甲方提供网上营业厅 <a href="http://www.189.cn/"><span
				style='color: windowtext; text-decoration: none; text-underline: none'>www.189.cn</span></a>、QQ客服（QQ号：800010000）、微信客服（公众号：中国电信海南客服）、易信客服（公众号：中国电信客服）、天翼客服客户端、客户服务电话10000等方式，以便甲方咨询了解乙方网络服务、业务推广、各类营销优惠活动等内容。乙方还应免费向甲方提供火警119、匪警110、医疗急救120、交通事故报警122等公益性电信服务并保障通信线路畅通。
		</p>

		<p class="MsoNormal">6.3 乙方免费提供给甲方最近
			5个月的通话详单查询、月结帐单查询（不含查询当月），对甲方通信费用方面的疑问应予以认真核实、详细解答。</p>
			
		<p class="MsoNormal">6.4
			乙方向甲方提供需要甲方支付功能费的服务项目时，应征得甲方同意，甲方无论以何种方式定制该服务，乙方对原始定制记录的保留期限应不少于
			5个月；甲方对定制开通有异议的，应在此期间内向乙方提出。乙方开通上述服务项目让甲方进行体验时，不得收取服务项目功能费。</p>


		<p class="MsoNormal">6.5
			对于甲方通信服务开通/关闭申请，乙方应在承诺的时限内操作完成（本协议双方另有约定的除外），超过承诺时限未及时开通/关闭的，乙方应减免甲方由此产生的不合理费用。</p>

		<p class="MsoNormal">6.6
			对于甲方通信服务开通/关闭申请，乙方应在承诺的时限内操作完成（本协议双方另有约定的除外），超过承诺时限未及时开通/关闭的，乙方应减免甲方由此产生的不合理费用。</p>

		<p class="MsoNormal">6.7
			当发生甲方网络服务通信障碍，乙方应在甲方申告障碍时起的48小时（城镇）或72小时（农村）内修复，通信障碍指非甲方终端设备原因引起的障碍。
		</p>

		<p class="MsoNormal">6.8
			本协议终止后，乙方有权收回甲方原使用的电话号码（“销号”），并在一定期限后分配给其他客户使用。</p>

		<p class="MsoNormal">6.9 乙方依本协议约定对甲方停机的，应提前以短信息等方式告知甲方。</p>

		<p class="MsoNormal">第七条 号码变更与转让</p>

		<p class="MsoNormal">7.1
			由于非甲方原因需要更改甲方电话号码时，乙方至少提前45日通知甲方，至少提前15日告知甲方新的电话号码。号码更改实施日起，至少45日内，乙方应向甲方提供所有来话播放改号提示音。</p>
			
		<p class="MsoNormal">7.2
			甲方拟转让通信产品使用权应先结清通信费等所有费用和违约金（如有），且甲方与受让方须持各自有效证件到乙方指定营业网点办理变更登记手续。</p>

		<p class="MsoNormal">第八条 UIM卡规定</p>

		<p class="MsoNormal">（1）甲方可自行设置和清除UIM卡的个人密码(PIN初始密码为1234)，连续三次输入错误密码将会锁卡。发生锁卡时，甲方不得自行解锁，应携带本人有效证件在乙方营业网点解锁。因甲方操作不当致使UIM卡损坏或锁死的，甲方应承担换卡所需费用。</p>

		<p class="MsoNormal">
			<b>（2）本协议期内，甲方若发生<span>UIM</span>卡遗失、被盗、人为损坏等情形，可向乙方申请办理“停机”、“补卡”业务，避免损失扩大。但甲方仍应交纳“停机”、“补卡”前产生的费用。
			</b>
		</p>

		<p class="MsoNormal">第九条 不可抗力及免责</p>

		<p class="MsoNormal">
			<b>因不可抗力导致本协议部分或全部不能履行的，双方可部分或全部免除责任。</b>
		</p>

		<p class="MsoNormal">第十条 技术进步</p>

		<p class="MsoNormal">因技术进步，经国家相关部门批准，乙方对通信网络进行整体换代升级而导致本协议无法继续履行的，乙方应该至少提前90日发布公告，并提出合理的解决方案。甲方可就解决方案与乙方协商，协商不成的，按本协议约定的争议解决方式解决</p>

		<p class="MsoNormal">第十一条 协议的变更</p>

		<p class="MsoNormal">
			<b>乙方在本协议外以本协议约定的公告等书面形式公开做出的服务承诺，自动成为本协议的组成部分，但为甲方设定义务或不合理地加重责任的除外。乙方公开做出的承诺标准低于本协议约定的，以本协议为准。</b>
		</p>

		<p class="MsoNormal">第十二条 协议的解除</p>

		<p class="MsoNormal">
			<b>12.1
				甲方要求终止网络服务的，应在结清相关费用及违约金（如有）后办理退网手续，话费余额退还甲方或按本协议双方另行约定（如有）处理。 </b>
		</p>

		<p class="MsoNormal">
			<b>12.2 遇到下列情况，乙方有权单方解除本协议，收回业务号码：</b>
		</p>

		<p class="MsoNormal">
			<b>（1）甲方办理入网、变更手续时提供的登记材料虚假不实；</b>
		</p>

		<p class="MsoNormal">
			<b>（2）该业务号码被执法、司法机关认定用于违法犯罪活动或其它不当用途；</b>
		</p>

		<p class="MsoNormal">
			<b>（3）乙方收到国家行政管理部门发文要求停止甲方网络服务；</b>
		</p>

		<p class="MsoNormal">
			<b>（4）甲方被停机60日后仍未补交通信费用和违约金，或被停机60日后仍未配合更正登记资料；</b>
		</p>

		<p class="MsoNormal">
			<b>（5）其他违反相关法律、法规、规章规定的行为。</b>
		</p>

		<p class="MsoNormal">第十三条 争议解决方式</p>


		<p class="MsoNormal">
			<b>所有因本协议引起的或与本协议有关的争议，本着互让互利的原则，通过协商解决。协商不成的，按以下第（ ）种方式解决争议：</b>
		</p>

		<p class="MsoNormal">
			<b>1、将该争议提交海南仲裁委员会仲裁解决；</b>
		</p>


		<p class="MsoNormal">
			<b>2、向有管辖权的人民法院提起诉讼。</b>
		</p>

		<p class="MsoNormal">第十四条 附则</p>


		<p class="MsoNormal">
			<b>14.1
				甲方办理各类业务所签署的业务登记单、表单、补充协议等均自动成为本协议的组成部分。业务登记单等文件内容与本协议条款内容冲突时，以该等文件为准。</b>
		</p>

		<p class="MsoNormal">
			<b>14.2
				乙方可以采用电话、广播、短信、彩信、电子邮件、电视、公开张贴、信函、报纸或互联网等方式进行业务公告、业务通知及服务沟通。</b>
		</p>

		<p class="MsoNormal">14.3本协议一式[两]份，甲乙双方各执[壹]份。</p>

		<p class="MsoNormal">第十五条 协议生效</p>

		<p class="MsoNormal">本协议期限为一年，自双方签字、盖章之日起计算。本协议届满，双方如无异议，本协议自动续期一年，以此类推顺延。</p>
	</div>
</body>
</html>