package com.linkage.portal.service.lte.dto;

import java.util.HashMap;
import java.util.Map;

public class AreaManageCode {
	private static Map<String, String> code = new HashMap<String, String>();
	static {
		
		
		code.put("011", "1101");// 北京市辖区
		code.put("010", "1101");//县
		code.put("022", "1201");//市辖区
		code.put("022", "1202");//县
		code.put("0311", "1301");//石家庄市 
		code.put("0315","1302");//唐山市 
		code.put("0335","1303");//皇岛市 
		code.put("0310","1304");//邯郸市 
		code.put("0319","1305");//邢台市 
		code.put("0312","1306");//保定市 
		code.put("0313","1307");//张家口市 
		code.put("0314","1308");//承德市 
		code.put("0317","1309");//沧州市 
		code.put("0316","1310");//廊坊市 
		code.put("0318","1311");//衡水市 
		code.put("0351","1401");//太原市 
		code.put("0352","1402");//大同市 
		code.put("0353","1403");//阳泉市 
		code.put("0355","1404");//长治市 
		code.put("0356","1405");//晋城市 
		code.put("0349","1406");//朔州市 
		code.put("0354","1407");//晋中市 
		code.put("0359","1408");//运城市 
		code.put("0350","1409");//忻州市 
		code.put("0357","1410");//临汾市 
		code.put("0358","1411");//吕梁市 
		code.put("0471","1501");//呼和浩特市
		code.put("0472","1502");//包头市
		code.put("0473","1503");//乌海市
		code.put("0476","1504");//赤峰市
		code.put("0475","1505");//通辽市
		code.put("0477","1506");//鄂尔多斯市
		code.put("0470","1507");//呼伦贝尔市
		code.put("0478","1508");//巴彦淖尔市
		code.put("0474","1509");//乌兰察布市
		code.put("0482","1522");//兴安盟
		code.put("0479","1525");//锡林郭勒盟
		code.put("0483","1529");//阿拉善盟
		code.put("024", "2101");//沈阳市
		code.put("0411","2102");//大连市
		code.put("0412","2103");//鞍山市
		code.put("024", "2104");//抚顺
		code.put("0414","2105");//本溪
		code.put("0415","2106");//丹东市
		code.put("0416","2107");//锦州市
		code.put("0417","2108");//营口市
		code.put("0418","2109");//阜新市
		code.put("0419","2110");//辽阳市
		code.put("0427","2111");//盘锦市
		code.put("024", "2112");//铁岭市
		code.put("0421","2113");//朝阳市
		code.put("0429","2114");//葫芦岛市
		code.put("0431","2201");//长春市
		code.put("0432","2202");//吉林市
		code.put("0434","2203");//四平市
		code.put("0437","2204");//辽源市
		code.put("0435","2205");//通化市
		code.put("0439","2206");//白山市
		code.put("0438","2207");//松原市
		code.put("0436","2208");//白城市
		code.put("0433","2224");//延边朝鲜族自治州
		code.put("0451","2301");//哈尔滨市
		code.put("0452","2302");//齐齐哈尔市
		code.put("0467","2303");//鸡西市
		code.put("0468","2304");//鹤岗市
		code.put("0469","2305");//双鸭山市
		code.put("0459","2306");//大庆市
		code.put("0458","2307");//伊春市
		code.put("0454","2308");//佳木斯市
		code.put("0464","2309");//七台河市
		code.put("0453","2310");//牡丹江市
		code.put("0456","2311");//黑河市
		code.put("0455","2312");//绥化市
		code.put("0457","2327");//大兴安岭地区
		code.put("021", "3101");//市辖区
		//code.put("021", "3102");//县
		code.put("025", "3201");//南京市
		code.put("	",  "320101");//
		code.put("	",  "320115");//
		code.put("	",  "320116");//
		code.put("	",  "320124");//
		code.put("	",  "320125");//
		code.put("	",  "320130");//
		code.put("0510","3202");//无锡市
		code.put("		","320201");//
		code.put("		","320281");//
		code.put("		","320282");//
		code.put("0516",    "3203");//   徐州市
		code.put("		","320301");//
		code.put("		","320305");//
		code.put("		","320312");//
		code.put("		","320321");//
		code.put("		","320322");//
		code.put("		","320324");//
		code.put("		","320381");//
		code.put("		","320382");//
		code.put("0519",	"3204");//常州市
		code.put("		","320401");//　
		code.put("		","320481");//　
		code.put("		","320482");//　
		code.put("0512",	"3205");//苏州市
		code.put("		","320501");//　
		code.put("		","320581");//　
		code.put("		","320582");//　
		code.put("		","320583");//　
		code.put("		","320584");//　
		code.put("		","320585");//　
		code.put("0513",	"3206");//南通市
		code.put("		","320601");//　
		code.put("		","320612");//　
		code.put("		","320621");//　
		code.put("		","320623");//　
		code.put("		","320681");//　
		code.put("		","320682");//　
		code.put("		","320684");//　
		code.put("0518",	"3207");//连云港市
		code.put("		","320701");//　
		code.put("		","320721");//　
		code.put("		","320722");//　
		code.put("		","320723");//　
		code.put("		","320724");//　
		code.put("0517",	"3208");//淮安市
		code.put("		","320801");//　
		code.put("		","320803");//　
		code.put("		","320804");//　
		code.put("		","320826");//　
		code.put("		","320829");//　
		code.put("		","320830");//　
		code.put("		","320831");//　
		code.put("0515",	"3209");//盐城市
		code.put("		","320901");//　
		code.put("		","320921");//　
		code.put("		","320922");//　
		code.put("		","320923");//　
		code.put("		","320924");//　
		code.put("		","320925");//　
		code.put("		","320981");//　
		code.put("		","320982");//　
		code.put("0514",	"3210");//扬州市
		code.put("		","321001");//　
		code.put("		","321003");//　
		code.put("		","321023");//　
		code.put("		","321081");//　
		code.put("		","321084");//　
		code.put("		","321088");//　
		code.put("		","321090");//　
		code.put("0511",	"3211");//镇江市
		code.put("		","321101");//　
		code.put("		","321181");//　
		code.put("		","321182");//　
		code.put("		","321183");//　
		code.put("0523",	"3212");//泰州市
		code.put("		","321201");//　
		code.put("		","321281");//　
		code.put("		","321282");//　
		code.put("		","321283");//　
		code.put("		","321284");//　
		code.put("0527",	"3213");//宿迁市
		code.put("		","321301");//　
		code.put("		","321311");//　
		code.put("		","321322");//　
		code.put("		","321323");//　
		code.put("		","321324");//　
		code.put("0571","3301");//杭州市
		code.put("0574","3302");//宁波市
		code.put("0577","3303");//温州市
		code.put("0573","3304");//嘉兴市
		code.put("0572","3305");//湖州市
		code.put("0575","3306");//绍兴市
		code.put("0579","3307");//金华市
		code.put("0570","3308");//衢州市
		code.put("0580","3309");//舟山市
		code.put("0576","3310");//台州市
		code.put("0578","3311");//丽水市
		code.put("0551","3401");//合肥市
		code.put("0553","3402");//芜湖市
		code.put("0552","3403");//蚌埠市
		code.put("0554","3404");//淮南市
		code.put("0555","3405");//马鞍山市
		code.put("0561","3406");//淮北市
		code.put("0562","3407");//铜陵市
		code.put("0556","3408");//安庆市
		code.put("0559","3410");//黄山市
		code.put("0550","3411");//滁州市
		code.put("0558","3412");//阜阳市
		code.put("0557","3413");//宿州市
		code.put("0565","3414");//巢湖市
		code.put("0564","3415");//六安市
		code.put("0560","3416");//亳州市
		code.put("0566","3417");//池州市
		code.put("0563","3418");//宣城市
		code.put("0591","3501");//福州市
		code.put("0592","3502");//厦门市
		code.put("0594","3503");//莆田市
		code.put("0593","3504");//三明市
		code.put("0595","3505");//泉州市
		code.put("0596","3506");//漳州市
		code.put("0599","3507");//南平市
		code.put("0597","3508");//龙岩市
		code.put("0598","3509");//宁德市
		code.put("0791","3601");//南昌市
		code.put("0798","3602");//景德镇市
		code.put("0799","3603");//萍乡市
		code.put("0792","3604");//九江市
		code.put("0790","3605");//新余市
		code.put("0701","3606");//鹰潭市
		code.put("0797","3607");//赣州市
		code.put("0796","3608");//吉安市
		code.put("0795","3609");//宜春市
		code.put("0794","3610");//抚州市
		code.put("0793","3611");//上饶市
		code.put("0531","3701");//济南市
		code.put("0532","3702");//青岛市
		code.put("0533","3703");//淄博市
		code.put("0632","3704");//枣庄市
		code.put("0546","3705");//东营市
		code.put("0535","3706");//烟台市
		code.put("0536","3707");//潍坊市
		code.put("0537","3708");//济宁市
		code.put("0538","3709");//泰安市
		code.put("0631","3710");//威海市
		code.put("0633","3711");//日照市
		code.put("0634","3712");//莱芜市
		code.put("0539","3713");//临沂市
		code.put("0534","3714");//德州市
		code.put("0635","3715");//聊城市
		code.put("0543","3716");//滨州市
		code.put("0530","3717");//荷泽市
		code.put("0371","4101");//郑州市
		code.put("0378","4102");//开封市
		code.put("0379","4103");//洛阳市
		code.put("0375","4104");//平顶山市
		code.put("0372","4105");//安阳市
		code.put("0392","4106");//鹤壁市
		code.put("0373","4107");//新乡市
		code.put("0391","4108");//焦作市
		code.put("0393","4109");//濮阳市
		code.put("0374","4110");//许昌市
		code.put("0395","4111");//漯河市
		code.put("0398","4112");//三门峡市
		code.put("0377","4113");//南阳市
		code.put("0370","4114");//商丘市
		code.put("0376","4115");//信阳市
		code.put("0394","4116");//周口市
		code.put("0396","4117");//驻马店市
		code.put("027", "4201");//武汉市
		code.put("0714","4202");//黄石市
		code.put("0719","4203");//十堰市
		code.put("0717","4205");//宜昌市
		code.put("0710","4206");//襄樊市
		code.put("0711","4207");//鄂州市
		code.put("0724","4208");//荆门市
		code.put("0712","4209");//孝感市
		code.put("0716","4210");//荆州市
		code.put("0713","4211");//黄冈市
		code.put("0715","4212");//咸宁市
		code.put("0722","4213");//随州市
		code.put("0718","4228");//恩施土家族苗族自治州
		code.put("0728","4290");//省直辖行政单位（仙桃、天门、潜江）
		code.put("0719","429021");//林区（神农架）
		code.put("0731","4301");//长沙市
		code.put("0731","4302");//株洲市
		code.put("0731","4303");//湘潭市
		code.put("0734","4304");//衡阳市
		code.put("0739","4305");//邵阳市
		code.put("0730","4306");//岳阳市
		code.put("0736","4307");//常德市
		code.put("0744","4308");//张家界市
		code.put("0737","4309");//益阳市
		code.put("0735","4310");//郴州市
		code.put("0746","4311");//永州市
		code.put("0745","4312");//怀化市
		code.put("0738","4313");//娄底市
		code.put("0743","4331");//湘西土家族苗族自治州
		code.put("020", "4401");//广州市
		code.put("0751","4402");//韶关市
		code.put("0755","4403");//深圳市
		code.put("0756","4404");//珠海市
		code.put("0754","4405");//汕头市
		code.put("0757","4406");//佛山市
		code.put("0750","4407");//江门市
		code.put("0759","4408");//湛江市
		code.put("0668","4409");//茂名市
		code.put("0758","4412");//肇庆市
		code.put("0752","4413");//惠州市
		code.put("0753","4414");//梅州市
		code.put("0660","4415");//汕尾市
		code.put("0762","4416");//河源市
		code.put("0662","4417");//阳江市
		code.put("0763","4418");//清远市
		code.put("0769","4419");//东莞市
		code.put("0760","4420");//中山市
		code.put("0768","4451");//潮州市
		code.put("0663","4452");//揭阳市
		code.put("0766","4453");//云浮市
		code.put("0771","4501");//南宁市
		code.put("0772","4502");//柳州市
		code.put("0773","4503");//桂林市
		code.put("0774","4504");//梧州市
		code.put("0779","4505");//北海市
		code.put("0770","4506");//防城港市
		code.put("0777","4507");//钦州市
		code.put("0775","4508");//贵港市
		code.put("0775","4509");//玉林市
		code.put("0776","4510");//百色市
		code.put("0774","4511");//贺州市
		code.put("0778","4512");//河池市
		code.put("0772","4513");//来宾市
		code.put("0771","4514");//崇左市
		code.put("0898","4601");//海口市
		code.put("0898","4602");//三亚市
		code.put("0898","4690");//省直辖县级行政单位
		code.put("023", "5001");//市辖区
		code.put("023", "5002");//县
		code.put("023","5003");//	市
		code.put("		","500301");//
		code.put("		","500302");//
		code.put("		","500303");//
		code.put("		","500304");//
		code.put("		","500303");//
		code.put("		","500304");//
		code.put("		","500303");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500305");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500302");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500304");//
		code.put("		","500301");//
		code.put("		","500301");//
		code.put("		","500302");//
		code.put("		","500302");//
		code.put("		","500302");//
		code.put("		","500301");//
		code.put("		","500301");//
		code.put("		","500301");//
		code.put("		","500301");//
		code.put("		","500301");//
		code.put("		","500301");//
		code.put("		","500305");//
		code.put("		","500305");//
		code.put("		","500305");//
		code.put("		","500305");//
		code.put("028", "5101");//成都市
		code.put("0813","5103");//自贡市
		code.put("0812","5104");//攀枝花市
		code.put("0830","5105");//泸州市
		code.put("0838","5106");//德阳市
		code.put("0816","5107");//绵阳市
		code.put("0839","5108");//广元市
		code.put("0825","5109");//遂宁市
		code.put("0832","5110");//内江市
		code.put("0833","5111");//乐山市
		code.put("0817","5113");//南充市
		code.put("028", "5114");//眉山市
		code.put("0831","5115");//宜宾市
		code.put("0826","5116");//广安市
		code.put("0818","5117");//达州市
		code.put("0835","5118");//雅安市
		code.put("0827","5119");//巴中市
		code.put("028", "5120");//资阳市
		code.put("0837","5132");//阿坝藏族羌族自治州
		code.put("0836","5133");//甘孜藏族自治州
		code.put("0834","5134");//凉山彝族自治州
		code.put("0851","5201");//贵阳市
		code.put("0858","5202");//六盘水市
		code.put("0852","5203");//遵义市
		code.put("0853","5204");//安顺市
		code.put("0856","5222");//铜仁地区
		code.put("0859","5223");//黔西南布依族苗族自治州
		code.put("0857","5224");//毕节地区
		code.put("0855","5226");//黔东南苗族侗族自治州
		code.put("0854","5227");//黔南布依族苗族自治州
		code.put("0871","5301");//昆明市
		code.put("0874","5303");//曲靖市
		code.put("0877","5304");//玉溪市
		code.put("0875","5305");//保山市
		code.put("0870","5306");//昭通市
		code.put("0888","5307");//丽江市
		code.put("0879","5308");//思茅市
		code.put("0883","5309");//临沧市
		code.put("0878","5323");//楚雄彝族自治州
		code.put("0873","5325");//红河哈尼族彝族自治州
		code.put("0876","5326");//文山壮族苗族自治州
		code.put("0691","5328");//西双版纳傣族自治州
		code.put("0872","5329");//大理白族自治州
		code.put("0692","5331");//德宏傣族景颇族自治州
		code.put("0886","5333");//怒江傈僳族自治州
		code.put("0887","5334");//迪庆藏族自治州
		code.put("0891","5401");//拉萨市
		code.put("0895","5421");//昌都地区
		code.put("0893","5422");//山南地区
		code.put("0892","5423");//日喀则地区
		code.put("0896","5424");//那曲地区
		code.put("0897","5425");//阿里地区
		code.put("0894","5426");//林芝地区
		code.put("029", "6101");//西安市
		code.put("0919","6102");//铜川市
		code.put("0917","6103");//宝鸡市
		code.put("0910","6104");//咸阳市
		code.put("0913","6105");//渭南市
		code.put("0911","6106");//延安市
		code.put("0916","6107");//汉中市
		code.put("0912","6108");//榆林市
		code.put("0915","6109");//安康市
		code.put("0914","6110");//商洛市
		code.put("0931","6201");//兰州市
		code.put("0937","6202");//嘉峪关市
		code.put("0935","6203");//金昌市
		code.put("0943","6204");//白银市
		code.put("0938","6205");//天水市
		code.put("0935","6206");//武威市
		code.put("0936","6207");//张掖市
		code.put("0933","6208");//平凉市
		code.put("0937","6209");//酒泉市
		code.put("0934","6210");//庆阳市
		code.put("0932","6211");//定西市
		code.put("0939","6212");//陇南市
		code.put("0930","6229");//临夏回族自治州
		code.put("0941","6230");//甘南藏族自治州
		code.put("0971","6301");//西宁市
		code.put("		","630101");//
		code.put("		","      ");//
		code.put("		","630121");//
		code.put("		","630122");//
		code.put("		","630123");//
		code.put("0972","6321");//海东地区
		code.put("		","632121");//	
		code.put("		","632122");//	
		code.put("		","632123");//	
		code.put("		","632126");//	
		code.put("		","632127");//	
		code.put("		","632128");//	
		code.put("0970","6322");//海北藏族自治州
		code.put("		","632221");//
		code.put("		","      ");//
		code.put("		","632222");//	
		code.put("		","632223");//	
		code.put("		","632224");//	
		code.put("		","632299");//	
		code.put("0973","6323");//黄南藏族自治州
		code.put("		","632321");//	
		code.put("		","632322");//	
		code.put("		","632323");//	
		code.put("		","632324");//	
		code.put("0974","6325");//	海南藏族自治州
		code.put("		","632521");//	
		code.put("		","632522");//	
		code.put("		","632523");//	
		code.put("		","632524");//	
		code.put("		","632525");//	
		code.put("0975","6326");//	果洛藏族自治州
		code.put("    ","632621	 ");//
		code.put("    ","632622	 ");//
		code.put("    ","632623	 ");//
		code.put("		","632624");//
		code.put("		","632625");//
		code.put("		","632626");//
		code.put("0976","6327");//	玉树藏族自治州
		code.put("		","632721");//	
		code.put("		","632722");//	
		code.put("		","632723");//	
		code.put("		","632724");//	
		code.put("		","632725");//	
		code.put("		","632726");//	
		code.put("0977","6328");//	海西蒙古族藏族自治州
		code.put("		","632802");//	
		code.put("		","632821");//	
		code.put("		","632822");//	
		code.put("		","632823");//	
		code.put("		","632897");//	
		code.put("		","632898");//	
		code.put("		","632899");//	
		code.put("0979","632801");//格尔木市
		code.put("0951","6401");//银川市
		code.put("0952","6402");//石嘴山市
		code.put("0953","6403");//吴忠市
		code.put("0954","6404");//固原市
		code.put("0955","6405");//中卫市
		code.put("0991","6501");//乌鲁木齐市
		code.put("0990","6502");//克拉玛依市
		code.put("0995","6521");//吐鲁番地区
		code.put("0902","6522");//哈密地区
		code.put("0994","6523");//昌吉回族自治州
		code.put("0909","6527");//博尔塔拉蒙古自治州
		code.put("0996","6528");//巴音郭楞蒙古自治州
		code.put("0997","6529");//阿克苏地区
		code.put("0908","6530");//克孜勒苏柯尔克孜自治州
		code.put("0998","6531");//喀什地区
		code.put("0903","6532");//和田地区
		code.put("0999","6540");//伊犁哈萨克自治州
		code.put("0992","654003");//
		code.put("0901","6542");//塔城地区
		code.put("0906","6543");//阿勒泰地区
		code.put("0993","6590");//石河子市
		code.put("0000","9999");//临时
	}

	public static String getValue(String key) {
		return code.get(key);

	}

	public static boolean containsKey(String key) {
		return code.containsKey(key);

	}
}
